{
  "backend/main.mo": "Actor providing user profiles, access control, and an inquiry system with status tracking, sorting, and submission.",
  "feature_evidence.json": "Metadata describing feature implementations, related files, components, and test IDs for site-wide mobile prompt and WhatsApp flows.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH variables with light/dark modes and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React app root with TanStack Router, QueryClient, and global layout wrapped in MobileNumberPromptProvider.",
  "frontend/src/components/site/AgentApplicationForm.tsx": "Agent application form handling validation, submission, and success/error UI states.",
  "frontend/src/components/site/FloatingContactButtons.tsx": "Floating action buttons linking to phone and WhatsApp contact helpers.",
  "frontend/src/components/site/InquiryForm.tsx": "A contact form component that collects inquiry details, validates required fields, submits via a custom hook, and displays success or error messages.",
  "frontend/src/components/site/MobileNumberPromptModal.tsx": "A modal prompting users to enter and validate an Indian mobile number before confirming an action.",
  "frontend/src/components/site/MobileNumberPromptProvider.tsx": "A provider that intercepts clicks on interactive elements, opens a mobile-number prompt modal, and executes the original action after confirmation.",
  "frontend/src/components/site/SiteFooter.tsx": "The site footer displaying contact info, quick links, and a branded attribution section.",
  "frontend/src/components/site/SiteHeader.tsx": "The main site header with navigation links and an optional admin link based on user status.",
  "frontend/src/components/site/VillupuramMapEmbed.tsx": "Embeds a Google Maps iframe showing the Villupuram location with a simple layout wrapper.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, updating, creating, and deleting inquiries and agent applications via canister actors.",
  "frontend/src/hooks/useSubmitAgentApplication.ts": "Mutation hook that submits a new agent application and invalidates related queries.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Mutation hook for submitting a new inquiry with trimmed form fields and refreshing inquiry queries.",
  "frontend/src/index.css": "Tailwind CSS setup with LIC-themed color variables and utility classes for both light and dark modes.",
  "frontend/src/lib/contactLinks.ts": "Generates clickable phone and WhatsApp links, including a helper for prefilled inquiry messages.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrapping the root component.",
  "frontend/src/pages/AboutLicPage.tsx": "Static informational page describing LIC, its history, offerings, and values with styled sections.",
  "frontend/src/pages/AdminApplicationsPage.tsx": "Admin interface for viewing, sorting, updating, and deleting agent applications with dialogs and status management.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard, showing loading, access-denied handling, and links to inquiry and agent application management.",
  "frontend/src/pages/AdminInquiriesPage.tsx": "Displays and manages customer inquiries with sorting, status updates, and deletion via dialogs and API hooks.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details, call/WhatsApp actions, and an inquiry form with location map embedding.",
  "frontend/src/pages/HomePage.tsx": "Public landing page featuring hero content, LIC benefits, and navigation to contact and consultation options.",
  "frontend/src/pages/JoinAsAgentPage.tsx": "Promotes LIC agent careers with benefits overview and an application form section.",
  "frontend/src/pages/PolicyDetailsPage.tsx": "Provides detailed LIC policy information sections with benefits and call-to-action prompts.",
  "frontend/src/pages/ServicesPage.tsx": "React page rendering a services header and a grid of LIC service cards with icons and descriptions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing/retrieving them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements for expanding the LIC website, including recruitment features, UI changes, and site-wide interaction rules."
}