{
  "backend/main.mo": "Motoko canister managing user profiles and inquiries with access control, updates, sorting, and status tracking.",
  "feature_evidence.json": "Feature evidence report indicating AdSense script inclusion in the global HTML head.",
  "frontend-file-summaries.txt": "Text file containing summaries of multiple frontend components and pages.",
  "frontend/index.css": "Tailwind base and theme variables defining color system, dark mode, and global styles.",
  "frontend/index.html": "Root HTML file loading the React SPA and global Google AdSense script.",
  "frontend/public/google388a124de0fa03e3.html": "Google site verification HTML file for domain ownership validation.",
  "frontend/src/App.tsx": "Main React entry configuring routes, QueryClientProvider, layout, and global UI providers.",
  "frontend/src/components/site/AgentApplicationForm.tsx": "Form component handling LIC agent application submission with validation and success/error states.",
  "frontend/src/components/site/FloatingContactButtons.tsx": "Floating call and WhatsApp action buttons using dynamic contact links.",
  "frontend/src/components/site/InquiryForm.tsx": "Reusable inquiry submission form with validation, backend integration, and status messaging.",
  "frontend/src/components/site/MobileNumberPromptModal.tsx": "Modal component that collects and validates an Indian mobile number before confirming or cancelling.",
  "frontend/src/components/site/MobileNumberPromptProvider.tsx": "Context provider that intercepts clicks to show a mobile-number prompt and triggers actions after WhatsApp confirmation.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying contact info, quick links, and attribution with dynamic year and phone link.",
  "frontend/src/components/site/SiteHeader.tsx": "Header with branding, navigation links, and social/WhatsApp contact icons, including admin link logic.",
  "frontend/src/components/site/VillupuramMapEmbed.tsx": "Component embedding a Google Maps iframe showing Villupuram location.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refreshing related queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for managing Internet Identity login, state, and stored identities using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating inquiries and agent applications through the actor API with automatic cache invalidation.",
  "frontend/src/hooks/useSubmitAgentApplication.ts": "Defines a mutation hook to submit a new agent application and invalidate related queries.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a mutation hook to submit a customer inquiry and refresh inquiry data.",
  "frontend/src/index.css": "Sets global Tailwind styles and custom LIC-themed color variables for light and dark modes.",
  "frontend/src/lib/contactLinks.ts": "Generates phone and WhatsApp contact links, including prefilled inquiry messages.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutLicPage.tsx": "Renders an informational page about LIC with sections on offerings, history, and trust.",
  "frontend/src/pages/AdminApplicationsPage.tsx": "Admin interface for viewing, sorting, updating, and deleting agent applications.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays admin dashboard with navigation to manage inquiries and agent applications, with access control.",
  "frontend/src/pages/AdminInquiriesPage.tsx": "Admin page that lists inquiries with sorting, status updates via dialog, and delete actions using query hooks.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing personal details, call/WhatsApp links, and an inquiry form with a location map embed.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero CTA, introduction, and sections highlighting LIC benefits and services.",
  "frontend/src/pages/JoinAsAgentPage.tsx": "Page promoting LIC agent careers, outlining benefits and providing an application form.",
  "frontend/src/pages/PolicyDetailsPage.tsx": "Policy details page presenting LIC policy categories, benefits, and CTAs to call for guidance.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a styled header and a grid of LIC service cards using Tailwind and Lucide icons.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL/hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks the project state and requirements, detailing planned updates for the LIC site including recruitment features and UI changes."
}