{
  "backend/main.mo": "Motoko canister implementing user profiles, access-controlled admin/user actions, and a full inquiry system with status tracking and sorting.",
  "feature_evidence.json": "Feature evidence report mapping two mobile-number prompt features to affected React files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in routing, UI components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, theme layers, and base layout rules.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the React main script.",
  "frontend/src/App.tsx": "Main React app configuring the router, query client, layout, and global mobile-number prompt provider.",
  "frontend/src/components/site/AgentApplicationForm.tsx": "Form component for submitting agent applications with validation, mutation handling, and success/error states.",
  "frontend/src/components/site/FloatingContactButtons.tsx": "Floating call and WhatsApp buttons linked via helper utilities and displayed on all pages.",
  "frontend/src/components/site/InquiryForm.tsx": "A form component that collects inquiry details, validates required fields, and submits data using useSubmitInquiry with success and error handling.",
  "frontend/src/components/site/MobileNumberPromptModal.tsx": "A modal prompting users for a validated mobile number before continuing, with input normalization and error messaging.",
  "frontend/src/components/site/MobileNumberPromptProvider.tsx": "Context provider that intercepts clicks to show a mobile-number prompt modal and executes the original action afterward, storing session completion state.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying contact info, quick links, and attribution, using getPhoneLink and dynamic year.",
  "frontend/src/components/site/SiteHeader.tsx": "Header with navigation links and branding, conditionally showing an Admin link based on useIsCallerAdmin.",
  "frontend/src/components/site/VillupuramMapEmbed.tsx": "Component embedding a Google Maps iframe showing Villupuram’s location with optional toggle.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to user identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, stored identities, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, creating, updating, and deleting inquiries and agent applications through the backend actor.",
  "frontend/src/hooks/useSubmitAgentApplication.ts": "Exports a mutation hook to submit new agent applications and invalidate related queries.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Exports a mutation hook to submit new inquiries and refresh inquiry lists.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, themes, typography, and LIC-specific utility classes.",
  "frontend/src/lib/contactLinks.ts": "Generates phone and WhatsApp links, including prefilled WhatsApp messages for user prompts.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutLicPage.tsx": "Presents a styled informational page describing LIC, its offerings, and its history.",
  "frontend/src/pages/AdminApplicationsPage.tsx": "Admin interface for viewing, sorting, updating, and deleting agent applications with status dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard that checks admin access and links to manage inquiries and agent applications.",
  "frontend/src/pages/AdminInquiriesPage.tsx": "Admin interface for viewing, sorting, updating, and deleting customer inquiries with status management.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, call-to-action buttons, and an inquiry form with a map embed.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring LIC overview, call-to-action buttons, benefits, and introductory content.",
  "frontend/src/pages/JoinAsAgentPage.tsx": "Promotes LIC agent recruitment with benefits overview and an application form.",
  "frontend/src/pages/PolicyDetailsPage.tsx": "Shows detailed sections describing various LIC policy types with benefits and CTAs.",
  "frontend/src/pages/ServicesPage.tsx": "React page rendering a styled services grid with icons and descriptions for various LIC-related offerings.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugins enabled.",
  "project_state.json": "JSON file describing the project’s current state, requirements, design notes, and existing features for the LIC website."
}