{
  "kind": "build_request",
  "title": "Show WhatsApp mobile-number prompt only once per browser session and auto-open WhatsApp on Continue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Update the site-wide mobile-number prompt flow so the prompt is shown only once per browser session: after a user successfully enters a valid mobile number and clicks Continue, do not show the prompt again until the browser session ends (i.e., sessionStorage is cleared).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Change the prompt as only 1 time for one browser instead of each click",
          "1. per session"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh session (new tab/sessionStorage cleared), the first click on a clickable control (<button>, <a>, or elements matching the provider’s selector) opens the mobile-number prompt modal.",
        "After the user enters a valid Indian mobile number and clicks Continue, a session flag is stored so subsequent clicks in the same session do NOT open the modal.",
        "On subsequent clicks in the same session, the original click action proceeds normally without being blocked by the modal.",
        "If the user reloads the page in the same session, the modal still does not reappear on clicks (the per-session behavior persists via sessionStorage).",
        "If sessionStorage is cleared or a new browser session starts, the modal appears again on the first click."
      ]
    },
    {
      "id": "REQ-31",
      "text": "When the user clicks Continue in the mobile-number prompt modal (after successful validation), immediately open WhatsApp to 9095077994 with the prefilled message that includes the entered mobile number (using the existing WhatsApp link helper), with no additional confirmation step; then close the prompt and continue the originally attempted click action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Also, automatically send message as soon as the user clicks continue button after entering phone number.",
          "yes no extra confirmation, just send automatically without redirecting",
          "2.yes"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Continue with a valid mobile number opens WhatsApp immediately in a new tab/window using the existing helper (getWhatsAppLinkForPrompt) and includes the entered mobile number in the prefilled message.",
        "No extra intermediate confirmation UI is shown after Continue.",
        "After opening WhatsApp, the modal closes.",
        "After opening WhatsApp, the originally blocked click action is executed exactly once.",
        "The WhatsApp auto-open behavior occurs only when the modal is shown (i.e., it follows the same per-session rule)."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed in frontend.immutablePaths must not be edited.",
    "Keep all user-facing text in English.",
    "Continue using the existing WhatsApp link helper in frontend/src/lib/contactLinks.ts for consistent message formatting."
  ],
  "nonGoals": [
    "Do not change the WhatsApp phone number (must remain 9095077994).",
    "Do not add any backend persistence for the captured mobile number.",
    "Do not alter unrelated site pages, navigation, or admin functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}